package homework03;

import java.util.Scanner;

public class Task02 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in); // объявили считывающеую переменную in и присвоили значение, которое позволит считывать значение из потока ввода System.in
        System.out.println("Введите целое положительное число, сумму цифр которого хотите посчитать"); // вывод строки с просьбой ввести в терминал число
        int number = in.nextInt();
        /* объявили целочисленную переменную number, в которую считывается ввод пользователя и присвоили ей значение in.nextInt(),
        где in - переменная у которой вызываем команду;
        nextInt() - команда, которая считывает из терминала целое введенное число и сохраняет его в переменную number
        */
        int sum = 0; // объявили и присвоили целочисленной переменной sum значение 0, что позволит в дальнейшем накапливать вычисления из нижеидущего цикла While
        while (number > 0) { // пока число, введенное пользователем с консоли после вычислений > 0, тело цикла While повторяется
            int digit = number % 10; // объявили целочисленную переменную digit и присвоили ей значение остатка от деления на 10, т.е. определяем младшую по разряду цифру числа number
            sum = sum + digit; // переопределили значение переменной sum так, что к переменной sum = 0 прибавляется и ранее определенная цифра
            number = (number-digit)/10; // отсекаем младший разряд из нашего числа number, чтобы при следующей итерации определить цифру вышестоящего разряда
        }
        System.out.println(sum); // вывод в терминал значения sum, которое накапливает результат вычислений цикла while, т.е. сумма цифр, составляющих число number
    }
}
