package homework02;

public class Task06 {
    public static void main(String[] args) {
        double sum = 1999; // объявили в переменную sum сумма покупки и присвоили ей значение
        int saleCode = 7647; // объявили целочисленную переменную saleCode номер номер купона на скидку и присвоили ей значение
        // оператор switch применим к известному числу возможных ситуаций
        /*Switch работает со следующими типами данных:
        byte / Byte
        short / Short
        int / Integer
        char / Character
        enum
        String
         */
        // Выражение/переменная в switch проверяется на равенство со значениями в case. Если соответствие установлено инструкции начинают выполняться от соответствующего case и далее до ближайшего break или до конца switch
        switch (saleCode) {
            // Если номер купона равен 4525 - вывести сумму с учетом скидки 30%
            case 4525:
                System.out.println("Сумма покупки с учетом скидки в 30 % составляет " + sum * 0.7);
                // Если номер купона равен 6424 или 7012 - вывести сумму с учетом скидки 20%
                break; // оператор break прерывает свой блок кода. Его нужно использовать обязательно, иначе выполнение инструкций продолжится
            case 6424: // Если инструкции в блоках case совпадают, то блоки можно объединить
            case 7012:
                System.out.println("Сумма покупки с учетом скидки в 20 % составляет " + sum * 0.8);
                // Если номер купона равен 7647 или 9011 или 6612 - вывести сумму с учетом скидки 10%
                break;
            case 7647, 9011, 6612:
                System.out.println("Сумма покупки с учетом скидки в 10 % составляет " + sum * 0.9);
                break;
            default: // Если совпадений не будет, то исполняется команда после ключевого слова default. Однако оператор default не является обязательным. В этом случае при отсутствии совпадений программа не выполняет никаких действий.
                System.out.println("Скидка не предусмотрена. Сумма покупки составляет " + sum);
        }
    }
}
