package homework02;

public class Task05 {
    public static void main(String[] args) {
        // В библиотеке классов Java есть пакет java.lang, у которого есть класс Math, а у класса Math есть метод random()
        // Метод Math.random() – в Java используется для генерации случайного числа в диапазоне от 0.0 (min) до 1.0 (max). Различные диапазоны могут быть достигнуты с помощью арифметики
        // В Java Math.random() возвращает случайное double значение с положительным знаком в диапазоне больше или равно 0.0 и меньше 1.0 (0.0 <= Math.random() < 1.0).
        // ( Math.random() * (max-min) ) + a формула генерации числа из другого диапазона, отличного от [0;1)
        // (int)(( Math.random() * (max - min + 1)) + min формула генерации целочисленного числа из другого диапазона, отличного от [0;1)
        int min = 10; // объявили целочисленную переменную min (нижний лимит диапазона для метода Math.random()) и присвоили ей значение
        int max = 500; // объявили целочисленную переменную max (верхний лимит диапазона для метода Math.random()) и присвоили ей значение
        int difference = max - min; // объявили целочисленную переменную difference (разница между нижним и верхним лимитами диапазона для метода Math.random()
        // Диапазон [0;1) умножаем на 491
        // получаем диапазон [0;491), 491 исключительно, следовательно максимальное достижимое число в данном диапазоне 491.999999...имеем дело с вещественным диапазоном
        // применяем (int) перед  Math.random()*491. Вещественная часть отсекается и мы получаем диапазон [0;490]
        // к диапазону [0;490] прибавляем 10 и получаем диапазон [10;500]
        int randomNumber = (int) (Math.random() * (difference + 1)) + min;
        int lowLimitRange = 25; // объявили целочисленную переменную lowLimitRange и присвоили ей значение
        int highLimitRange = 200; // объявили целочисленную переменную highLimitRange и присвоили ей значение
        if (randomNumber > lowLimitRange & randomNumber < highLimitRange) {
            System.out.println("Число " + randomNumber + " содержится в интервале " + "(" + lowLimitRange + ";" + highLimitRange + ")");
        } else {
            System.out.println("Число " + randomNumber + " не содержится в интервале " + "(" + lowLimitRange + ";" + highLimitRange + ")");
        }
    }
}
