package homework05;

public class Task02 {
    public static void main(String[] args) {
        /*2. **Дан текст**: _JAVA стоит первым в рейтинге популярности использования языков; JAVA один из наиболее мощных
        высокоуровневых языков программирования; JAVA поддерживает большое количество встроенных библиотех, которые позволяют
        быстро писать проекты любого класса сложности; курс «JUNIOR JAVA DEVELOPER» предназначен для подготовки
        программистов-профессионалов, специализирующихся на разработке программного обеспечения различного класса и уровня
        сложности_. **Все слова "JAVA" в данном тексте заменить на "PYTHON"**.
        3. Вывести в консоль количество слов "JAVA", встречающихся в тексте из предыдущего задания
         */
        // String stringText = "JAVA стоит первым в рейтинге популярности использования языков; JAVA один из наиболее мощных высокоуровневых языков программирования; JAVA поддерживает большое количество встроенных библиотех, которые позволяют быстро писать проекты любого класса сложности; курс «JUNIOR JAVA DEVELOPER» предназначен для подготовки программистов-профессионалов, специализирующихся на разработке программного обеспечения различного класса и уровня сложности .";
        String stringText = " JAVA стоит первым в рейтинге популярности использования языков; JAVA один из наиболее мощных\n" +
                "        высокоуровневых языков программирования; JAVA поддерживает большое количество встроенных библиотех, которые позволяют\n" +
                "        быстро писать проекты любого класса сложности; курс «JUNIOR JAVA DEVELOPER» предназначен для подготовки\n" +
                "        программистов-профессионалов, специализирующихся на разработке программного обеспечения различного класса и уровня\n" +
                "        сложности .";
        String stringJava = "JAVA";
        String stringPython = "PYTHON";
        int i = 0;
        while (stringText.contains(stringJava)) {
            stringText = stringText.replaceFirst(stringJava, stringPython);
            i += 1;
        }
        System.out.println(stringText.stripIndent());
        System.out.println("Число замененных слов JAVA: " + i);
    }
}
